# TrussUserDefinedMemberDeleted Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..TrussFailures..::..TrussUserDefinedMemberDeleted Property
BuiltInFailures..::..TrussFailures Class See Also
---
A user-defined structural member was deleted due to missing or deleted references.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TrussUserDefinedMemberDeleted { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussUserDefinedMemberDeleted As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TrussUserDefinedMemberDeleted {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..TrussFailures Class
Autodesk.Revit.DB Namespace